rtek1000/STM32F4HUB_modified/Project-STM32CubeIDE_USBH_HID/F407_USBH_HID/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
	return status;
}

static void USBH_HID_IncrementInterface(USBH_HandleTypeDef *phost) {
	// switch interface
	phost->device.current_interface++;
	if (phost->device.current_interface >= phost->device.CfgDesc.bNumInterfaces)
		phost->device.current_interface = 0;
}

/**
 * @brief  USBH_HID_Process
 *         The function is for managing state machine for HID data transfers
 * @param  phost: Host handle
 * @retval USBH Status
 */
static USBH_StatusTypeDef USBH_HID_Process(USBH_HandleTypeDef *phost) {
	USBH_StatusTypeDef status = USBH_OK;

	uint8_t URBState;

	uint8_t idx = phost->device.current_interface;

	HID_HandleTypeDef *HID_Handle =
			(HID_HandleTypeDef*) phost->pActiveClass->pData_array[idx];
	uint32_t XferSize;

	switch (HID_Handle->state) {
	case HID_INIT:
		USBH_UsrLog("HID_INIT");
		HID_Handle->Init(phost);
		HID_Handle->state = HID_IDLE;

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

	case HID_IDLE:
		USBH_UsrLog("HID_IDLE");
		status = USBH_HID_GetReport(phost, 0x01U, 0U, HID_Handle->pData,
				(uint8_t) HID_Handle->length_array[0]);
		if (status == USBH_OK) {
			HID_Handle->state = HID_SYNC;
		} else if (status == USBH_BUSY) {
			HID_Handle->state = HID_IDLE;
			status = USBH_OK;
		} else if (status == USBH_NOT_SUPPORTED) {
			HID_Handle->state = HID_SYNC;
			status = USBH_OK;
		} else {
			HID_Handle->state = HID_ERROR;
			status = USBH_FAIL;
		}

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

	case HID_SYNC:
		USBH_UsrLog("HID_SYNC");
		/* Sync with start of Even Frame */
		if ((phost->Timer & 1U) != 0U) {
			HID_Handle->state = HID_GET_DATA;
		}

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

	case HID_GET_DATA:
		//USBH_UsrLog("HID_GET_DATA");
		(void) USBH_InterruptReceiveData(phost, HID_Handle->pData,
				(uint8_t) HID_Handle->length_array[0], HID_Handle->InPipe);

		HID_Handle->state = HID_POLL;
		HID_Handle->timer = phost->Timer;
		HID_Handle->DataReady = 0U;
		break;

	case HID_POLL:
		//USBH_UsrLog("HID_POLL");
		URBState = (uint8_t) USBH_LL_GetURBState(phost, HID_Handle->InPipe);

		if (URBState == USBH_URB_DONE) {
			USBH_UsrLog("USBH_URB_DONE, interface: %d", idx);
			XferSize = USBH_LL_GetLastXferSize(phost, HID_Handle->InPipe);

			if ((HID_Handle->DataReady == 0U) && (XferSize != 0U)) {
				(void) USBH_HID_FifoWrite(&HID_Handle->fifo, HID_Handle->pData,
						HID_Handle->length_array[0]);
				HID_Handle->DataReady = 1U;
				USBH_HID_EventCallback(phost);

#if (USBH_USE_OS == 1U)
          phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
          (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
          (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
			}
		} else if (URBState == USBH_URB_STALL) {
			USBH_UsrLog("USBH_URB_STALL");
			/* Issue Clear Feature on interrupt IN endpoint */
			if (USBH_ClrFeature(phost, HID_Handle->ep_addr_array[0])
					== USBH_OK) {
				/* Change state to issue next IN token */
				HID_Handle->state = HID_GET_DATA;

				// switch interface
				USBH_HID_IncrementInterface(phost);

				USBH_UsrLog("current_interface: %d",
						phost->device.current_interface);
			}

		} else if (URBState == USBH_URB_ERROR) {
			USBH_ErrLog("USBH_URB_ERROR");
		} else {
			if (URBState != USBH_URB_IDLE) {
				USBH_UsrLog("URBState: %d", URBState);
			}
		}
		break;

	default:
		break;
	}

	return status;
}

/**
 * @brief  USBH_HID_SOFProcess
 *         The function is for managing the SOF Process
 * @param  phost: Host handle
 * @retval USBH Status
 */
static USBH_StatusTypeDef USBH_HID_SOFProcess(USBH_HandleTypeDef *phost) {
	uint8_t idx = phost->device.current_interface;

	HID_HandleTypeDef *HID_Handle =
			(HID_HandleTypeDef*) phost->pActiveClass->pData_array[idx];

	if (HID_Handle->state == HID_POLL) {
		if ((phost->Timer - HID_Handle->timer) >= HID_Handle->poll_array[0]) {
			HID_Handle->state = HID_GET_DATA;

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif

			// switch interface
			USBH_HID_IncrementInterface(phost);
		}
	}
	return USBH_OK;
}

/**
 * @brief  USBH_Get_HID_ReportDescriptor
 *         Issue report Descriptor command to the device. Once the response
 *         received, parse the report descriptor and update the status.
 * @param  phost: Host handle
 * @param  Length : HID Report Descriptor Length
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_HID_GetHIDReportDescriptor(USBH_HandleTypeDef *phost,
		uint16_t length) {

	USBH_StatusTypeDef status;

	status = USBH_GetDescriptor(phost,
	USB_REQ_RECIPIENT_INTERFACE | USB_REQ_TYPE_STANDARD,
	USB_DESC_HID_REPORT, phost->device.Data, length);

	/* HID report descriptor is available in phost->device.Data.
	 In case of USB Boot Mode devices for In report handling ,
	 HID report descriptor parsing is not required.
	 In case, for supporting Non-Boot Protocol devices and output reports,
	 user may parse the report descriptor*/

	return status;
}

/**
 * @brief  USBH_Get_HID_Descriptor
 *         Issue HID Descriptor command to the device. Once the response
 *         received, parse the report descriptor and update the status.
 * @param  phost: Host handle
 * @param  Length : HID Descriptor Length
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_HID_GetHIDDescriptor(USBH_HandleTypeDef *phost,
		uint16_t length) {
	USBH_StatusTypeDef status;

	status = USBH_GetDescriptor(phost,
	USB_REQ_RECIPIENT_INTERFACE | USB_REQ_TYPE_STANDARD,
	USB_DESC_HID, phost->device.Data, length);

